Revit 2027 API
BuiltInFailures.ComponentRepeaterSlotFailures.ComponentRepeaterSlot_InvalidFamilyOnReload Property
 Reloaded family not appropriate for repeated component.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ComponentRepeaterSlot_InvalidFamilyOnReload { get; }
Public Shared ReadOnly Property ComponentRepeaterSlot_InvalidFamilyOnReload As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ComponentRepeaterSlot_InvalidFamilyOnReload {
	FailureDefinitionId^ get ();
}
static member ComponentRepeaterSlot_InvalidFamilyOnReload : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ComponentRepeaterSlotFailures Class
Autodesk.Revit.DB Namespace